import numpy as np

# Нулевой ранг
x = np.array(12)
print(x, "Ранг:", x.ndim)

# Векторы, первый ранг
print("====================================")
x = np.array([1, 2, 3, 4])
print(x, "Ранг:", x.ndim)

# Матрицы, второй ранг
print("====================================")
x = np.array([[5, 78, 2, 34, 0],
              [6, 79, 3, 35, 1],
              [7, 80, 4, 36, 2]])
print(x, "Ранг:", x.ndim)

# Третий ранг
print("====================================")
x = np.array([
    [
        [5, 78, 2, 34, 0],
        [6, 79, 3, 35, 1],
        [7, 80, 4, 36, 2]
    ],
    [
        [5, 78, 2, 34, 0],
        [6, 79, 3, 35, 1],
        [7, 80, 4, 36, 2]
    ],
    [
        [5, 78, 2, 34, 0],
        [6, 79, 3, 35, 1],
        [7, 80, 4, 36, 2]
    ]
])
print(x, "Ранг:", x.ndim)
